id: 70454b10-8bd3-11ed-a1eb-0242ac120002
name: shadow-credentials
author: Glenn Brown, Eric Biermann
description: |
  Adversaries may attempt to dump the contents of /etc/shadow to enable offline password cracking. 
  Most modern Linux operating systems use a combination of /etc/passwd and /etc/shadow to store user account information including password hashes in /etc/shadow. 
  By default, /etc/shadow is only readable by the root user. This query detects root/sudo attempts to dump the contents of /etc/shadow for offline cracking.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
  - DeviceProcessEvents
tactics:
- Credential Access
mitre_att:
- TA0006
- T1003
- T1003.008
query: |
  DeviceInfo
  | where Timestamp > ago(1d)
  | where OSPlatform == "Linux"
  | project DeviceId
  | join 
      (
      DeviceProcessEvents
      | where ActionType == "ProcessCreated"
      | where AccountName == "root" // only root can read shadow
      | where ProcessCommandLine has_cs "shadow" // filter before json_parse for performance
      | extend _InitiatingProcessCurrentWorkingDirectory = parse_json(tostring(AdditionalFields)).InitiatingProcessCurrentWorkingDirectory //parse out the working directory field
      | where ProcessCommandLine has_cs "etc/shadow" // check for relative paths from root dir
          or (_InitiatingProcessCurrentWorkingDirectory == "/etc") // check for relative paths from /etc dir
          or (ProcessCommandLine has_cs "../shadow") // check for relative relative paths from anywhere else
      )
      on DeviceId
  | summarize AttemptCount=count()
      by
      bin(ProcessCreationTime, 1h),
      DeviceName,
      DeviceId,
      InitiatingProcessAccountName,
      FolderPath,
      ProcessCommandLine
  | project
      ProcessCreationTime,
      DeviceName,
      DeviceId,
      InitiatingProcessAccountName,
      FolderPath,
      ProcessCommandLine,
      AttemptCount
