id: 70454b10-8bd3-11ed-a1eb-0242ac120002
name: passwd-shadow-credentials
description: |
  Adversaries may attempt to dump the contents of /etc/passwd and /etc/shadow to enable offline password cracking. 
  Most modern Linux operating systems use a combination of /etc/passwd and /etc/shadow to store user account information including password hashes in /etc/shadow. 
  By default, /etc/shadow is only readable by the root user.
requiredDataConnectors:
- connectorId: MicrosoftThreatProtection
  dataTypes:
  - DeviceInfo
  - DeviceProcessEvents
tactics:
- Credential Access
query: 
  let cred_files = pack_array("/etc/shadow", "/etc/passwd");
  DeviceInfo
  | where OSPlatform == "Linux"
  | join
    (DeviceProcessEvents
    | where AccountName == "root"
    | where ProcessCommandLine has_any(cred_files))
  on DeviceId
  | summarize ProcessCommandLineCount=dcount(ProcessCommandLine) by DeviceName, AccountName, InitiatingProcessFileName, ProcessCommandLine
  | project DeviceName, AccountName, InitiatingProcessFileName, ProcessCommandLine
